{
  "stepName": "Data Consolidation",
  "timestamp": "2025-08-13T03:14:44.800Z",
  "data": {
    "scrapedData": {
      "title": "HiQSense | AI & Automation for Small Businesses | HiQSense Smart Systems LTD",
      "description": "From web design to AI implementation",
      "keywords": [
        "Empowering Small Businesses with AI and Smart Automation",
        "About HiQSense",
        "Introducing Saski AI — Our Flagship Platform",
        "Frequently Asked Questions",
        "Schedule a Call with HiQSense",
        "About Us",
        "Our Vision",
        "Our Values",
        "Our Team",
        "Azar Obeidat",
        "Marwan Khanfar",
        "Mohammad Melhem",
        "Get in Touch",
        "Send Us a Message",
        "Connect With Us",
        "Solve the math problem",
        "Terms of Service",
        "1. Use of Services",
        "2. Project Engagement and Scope",
        "3. Pricing and Payment Terms",
        "4. Ownership and Licensing",
        "5. Confidentiality",
        "6. Hosting and Maintenance",
        "7. Limitations of Liability",
        "8. Termination",
        "9. Governing Law",
        "10. Contact",
        "XML Sitemap - Pages",
        "Pages Overview:",
        "Quick Navigation",
        "Got Questions ? Let's Find an Answer",
        "Privacy Policy",
        "1. Information We Collect",
        "2. How We Use Your Information",
        "3. Sharing of Information",
        "4. Data Security",
        "5. Data Retention",
        "6. Your Rights",
        "7. Changes to This Policy",
        "8. Contact"
      ],
      "content": "Empowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense\n\nEmpowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense\n\nEmpowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense\n\nAbout UsHiQSense is a Canadian technology company based in Saskatchewan. Our mission is to empower small businesses by making AI accessible, useful, and easy to implement.​About HiQSense Our Vision We envision a future where small businesses can harness the power of AI to operate efficiently, reduce costs, and grow sustainably—without needing technical expertise. At HiQSense, we’re committed to building smart, accessible tools that simplify complex tasks. Through innovations like Saski AI, we empower business owners to automate customer support, streamline operations, and focus on what truly matters—their customers and their growth. Our Values Accessibility – We make advanced AI simple and usable for everyone. Empowerment – We enable businesses to automate and grow on their own terms. Innovation – We continuously explore new ways to solve real-world problems. Simplicity – We design intuitive tools that work without complexity. Customer-Centricity – We listen closely and build solutions around real needs. Reliability – We deliver stable, dependable technology you can trust. Book free consultationOur TeamAt the heart of HiQSense is a multidisciplinary team of passionate innovators and builders.Azar ObeidatCo-Founder & CEO Drives HiQSense forward with a vision to make advanced AI accessible and impactful for small businesses. Crafts intuitive interfaces with a focus on user experienceMarwan KhanfarCTO & Co-FounderLeads technology innovation at HiQSense Crafts intuitive interfaces with a focus on user experienceMohammad MelhemCo-Founder - Business Development & StrategiesDrives strategic growth with deep market insight and relentless focus on impact. Schedule a Call with HiQSense\n\nHomeAbout UsFAQContactBook free consultationGet in TouchWe’d love to learn more about your business. Reach out to explore how we can help. Send Us a MessageConnect With UsHave a question or ready to get started? You can reach us by phone, email, or by visiting our Saskatoon office.Phone+1 306 261 8582Emailinfo@hiqsense.caAddress400-111 2nd Ave S , Saskatoon, SK, CA S7K 1K6Follow UsFirst Name *Last Name Email Address *Phone Number Company Message *I agree to the terms and conditions * Solve the math problemVerify you're human8 - 3 = ? Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD\n\nHomeAbout UsFAQContactBook free consultation Terms of Service Effective Date: March 28, 2025 This Terms of Service agreement (\"Agreement\") is entered into by and between HiQSense Smart Systems LTD (\"HiQSense\", \"we\", \"us\", or \"our\"), a Canadian-registered corporation, and any person or entity (\"you\" or \"your\") accessing or using our website, digital products, or custom software and automation services. By accessing our website or engaging our services, you acknowledge that you have read, understood, and agree to be bound by these terms. If you do not agree, please discontinue use of our website and services. 1. Use of Services Our services are intended for lawful business use. You agree not to use our website, platforms, or delivered systems for any unlawful activity or to violate any local, provincial, national, or international regulations. 2. Project Engagement and Scope All services begin with a discovery or consultation phase. Based on your business needs, we prepare a custom scope of work and formal quote. No project will commence until both parties agree in writing to the proposal, deliverables, and payment structure. 3. Pricing and Payment Terms HiQSense does not offer flat-rate pricing. All costs are project-specific and depend on the scope, complexity, and duration of the engagement. Payment terms, including deposits, installment schedules, and final payments, will be detailed in the proposal or service agreement. Late payments may delay delivery or incur additional charges. 4. Ownership and Licensing Unless otherwise agreed in writing, all custom-built code, workflows, or software solutions developed under a paid contract become the property of the client upon final payment. HiQSense retains the right to reuse general frameworks or non-client-specific utilities developed independently. 5. Confidentiality We maintain strict confidentiality over all materials, communications, and proprietary business or technical information shared with us. We will not disclose your data, ideas, designs, or internal systems to any third party without prior consent. 6. Hosting and Maintenance Hosting, updates, and technical support are not included by default. These services may be added under an Annual Maintenance Contract (AMC), which covers hosting management, software updates, minor modifications, and troubleshooting. 7. Limitations of Liability HiQSense makes every effort to build secure, reliable systems. However, we do not guarantee uninterrupted or error-free operation and are not liable for losses resulting from downtime, third-party service interruptions, or client-side misuse. Our liability is limited to the total fees paid under the specific service agreement. 8. Termination Either party may terminate an agreement with written notice. In the event of early termination by the client, any work completed to date will be invoiced and due. HiQSense reserves the right to suspend service or access in case of non-payment or violation of these terms. 9. Governing Law This Agreement is governed by the laws of the Province of Saskatchewan and applicable federal laws of Canada. Any disputes arising out of this Agreement shall be resolved through mediation or the courts of Saskatchewan. 10. Contact If you have questions about these terms, please contact us:HiQSense Smart Systems LTD400 – 111 2nd Ave S, Saskatoon, SK, S7K 1K6Email: info@hiqsense.caPhone: +1 306 261 8582 Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD\n\nXML Sitemap - Pages This sitemap contains all the main pages of our website. You can find more information about XML sitemaps on sitemaps.org. ← Back to Sitemap Index Pages Overview: This sitemap contains 6 pages, last updated on 2025-08-13 02:44:36 +00:00. Page URL Priority Change Frequency Last Modified https://hiqsense.com/about-us 0.7 monthly 2025-07-30 01:13:23 +00:00 https://hiqsense.com/contact 0.7 monthly 2025-07-30 01:14:13 +00:00 https://hiqsense.com/faq 0.8 weekly 2025-07-30 01:13:46 +00:00 https://hiqsense.com/home 1.0 weekly 2025-07-30 01:12:18 +00:00 https://hiqsense.com/privacy-policy 0.7 monthly 2025-07-30 01:15:11 +00:00 https://hiqsense.com/terms-of-service 0.7 monthly 2025-07-30 01:14:51 +00:00\n\nhttps://hiqsense.com/sitemap-pages.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-faq-categories.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-faq-questions.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-images.xml 2025-08-13T02:35:56.429Z This XML file does not appear to have any style information associated with it. The document tree is shown below.<sitemapindex xmlns=\"http://www.sitemaps.org/schemas/sitemap/0.9\"> <sitemap> <loc>https://hiqsense.com/sitemap-pages.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-faq-categories.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-faq-questions.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-images.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> ...</sitemapindex>\n\nHomeAbout UsFAQContactBook free consultationFrequently Asked QuestionsQuick NavigationGot Questions ? Let's Find an Answer Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD\n\nHomeAbout UsFAQContactBook free consultation Privacy Policy Effective Date: March 28, 2025 HiQSense Smart Systems LTD (\"HiQSense\", \"we\", \"our\", or \"us\") is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you interact with our website or services. 1. Information We Collect Personal Information: When you fill out forms, book consultations, or work with us, we may collect your name, email, phone number, and relevant business information. Technical Information: We may collect anonymized data such as IP address, browser type, device type, and browsing behavior using analytics tools like Google Analytics or Hotjar to improve user experience. Project Files & Data: If you provide documents, designs, APIs, databases, or content to complete your project, this information is treated as strictly confidential and is used only for the purpose of delivering the contracted services. 2. How We Use Your Information To communicate with you regarding your inquiry, consultation, or project To assess and deliver the services you request To improve our website and service offerings To manage billing and client accounts To comply with legal and regulatory obligations 3. Sharing of Information We do not sell, trade, or rent your personal information to third parties. We may share information with trusted partners only when necessary to operate our business—such as hosting providers (AWS, GCP, Heroku), payment processors (Stripe), or communication tools (Twilio, Calendly). These partners are required to protect your data in accordance with their own privacy policies and data protection laws. 4. Data Security We implement reasonable administrative, technical, and physical safeguards to protect your information from unauthorized access, use, or disclosure. This includes secure storage, access control, encryption, and regular security audits. 5. Data Retention We retain your information for as long as necessary to provide services and as required by law. You may request deletion of your personal data or project files at any time, unless retention is required for legal or operational reasons. 6. Your Rights You have the right to request access to your personal data, correct inaccuracies, or ask us to delete your information. To make such a request, please contact us using the details below. 7. Changes to This Policy We may update this Privacy Policy to reflect changes to our practices or legal obligations. Updates will be posted on this page with the revised effective date. 8. Contact If you have any questions or concerns about this policy, please contact us: HiQSense Smart Systems LTD 400 – 111 2nd Ave S, Saskatoon, SK, S7K 1K6 Email: info@hiqsense.ca Phone: +1 306 261 8582 Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
      "socialLinks": {
        "linkedin": "https://linkedin.com/in/azarobeidat",
        "facebook": "https://www.facebook.com/hiqsense/"
      },
      "contactInfo": {
        "emails": [
          "hiqsense@hiqsense.ca",
          "info@hiqsense.ca"
        ],
        "phones": [
          "+13062618582",
          "2025081302",
          "2025073001"
        ],
        "addresses": []
      },
      "technologies": [
        "React",
        "Shopify",
        "WooCommerce",
        "Tailwind",
        "AWS",
        "Google Cloud",
        "Stripe",
        "HubSpot"
      ],
      "lastScraped": "2025-08-13T03:13:53.512Z",
      "status": "success",
      "discoveredPages": [
        "https://hiqsense.com/",
        "https://hiqsense.com/contact",
        "https://hiqsense.com/home",
        "https://hiqsense.com/index",
        "https://hiqsense.com/about-us",
        "https://hiqsense.com/sitemap-pages.xml",
        "https://hiqsense.com/sitemap.xml",
        "https://hiqsense.com/faq",
        "https://hiqsense.com/privacy-policy",
        "https://hiqsense.com/terms-of-service"
      ],
      "categorizedPages": {
        "home": [
          "https://hiqsense.com/",
          "https://hiqsense.com/home",
          "https://hiqsense.com/index"
        ],
        "about": [
          "https://hiqsense.com/about-us"
        ],
        "contact": [
          "https://hiqsense.com/contact"
        ],
        "services": [
          "https://hiqsense.com/terms-of-service"
        ],
        "products": [],
        "team": [],
        "blog": [],
        "other": [
          "https://hiqsense.com/sitemap-pages.xml",
          "https://hiqsense.com/sitemap.xml",
          "https://hiqsense.com/faq",
          "https://hiqsense.com/privacy-policy"
        ]
      },
      "prioritizedPages": [
        "https://hiqsense.com/",
        "https://hiqsense.com/home",
        "https://hiqsense.com/index",
        "https://hiqsense.com/about-us",
        "https://hiqsense.com/contact",
        "https://hiqsense.com/terms-of-service",
        "https://hiqsense.com/sitemap-pages.xml",
        "https://hiqsense.com/sitemap.xml",
        "https://hiqsense.com/faq",
        "https://hiqsense.com/privacy-policy"
      ],
      "pageResults": [
        {
          "url": "https://hiqsense.com/",
          "status": "success",
          "duration": 0,
          "title": "HiQSense | AI & Automation for Small Businesses | HiQSense Smart Systems LTD",
          "description": "From web design to AI implementation",
          "content": "Empowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense",
          "contactInfo": {
            "emails": [
              "hiqsense@hiqsense.ca"
            ],
            "phones": [],
            "addresses": [],
            "phoneDetails": []
          },
          "technologies": [
            "React"
          ],
          "socialLinks": {},
          "keywords": [
            "Empowering Small Businesses with AI and Smart Automation",
            "About HiQSense",
            "Introducing Saski AI — Our Flagship Platform",
            "Frequently Asked Questions",
            "Schedule a Call with HiQSense"
          ]
        },
        {
          "url": "https://hiqsense.com/home",
          "status": "success",
          "duration": 0,
          "title": "HiQSense | AI & Automation for Small Businesses | HiQSense Smart Systems LTD",
          "description": "From web design to AI implementation",
          "content": "Empowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense",
          "contactInfo": {
            "emails": [
              "hiqsense@hiqsense.ca"
            ],
            "phones": [],
            "addresses": [],
            "phoneDetails": []
          },
          "technologies": [
            "React"
          ],
          "socialLinks": {},
          "keywords": [
            "Empowering Small Businesses with AI and Smart Automation",
            "About HiQSense",
            "Introducing Saski AI — Our Flagship Platform",
            "Frequently Asked Questions",
            "Schedule a Call with HiQSense"
          ]
        },
        {
          "url": "https://hiqsense.com/index",
          "status": "success",
          "duration": 0,
          "title": "HiQSense | AI & Automation for Small Businesses | HiQSense Smart Systems LTD",
          "description": "From web design to AI implementation",
          "content": "Empowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense",
          "contactInfo": {
            "emails": [
              "hiqsense@hiqsense.ca"
            ],
            "phones": [],
            "addresses": [],
            "phoneDetails": []
          },
          "technologies": [
            "React"
          ],
          "socialLinks": {},
          "keywords": [
            "Empowering Small Businesses with AI and Smart Automation",
            "About HiQSense",
            "Introducing Saski AI — Our Flagship Platform",
            "Frequently Asked Questions",
            "Schedule a Call with HiQSense"
          ]
        },
        {
          "url": "https://hiqsense.com/about-us",
          "status": "success",
          "duration": 0,
          "title": "About HiQSense | AI-Driven Digital Solutions | HiQSense Smart Systems LTD",
          "description": "HiQSense is a Canadian technology company based in Saskatchewan.\nOur mission is to empower small businesses by making AI accessible, useful, and easy to implement.​",
          "content": "About UsHiQSense is a Canadian technology company based in Saskatchewan. Our mission is to empower small businesses by making AI accessible, useful, and easy to implement.​About HiQSense Our Vision We envision a future where small businesses can harness the power of AI to operate efficiently, reduce costs, and grow sustainably—without needing technical expertise. At HiQSense, we’re committed to building smart, accessible tools that simplify complex tasks. Through innovations like Saski AI, we empower business owners to automate customer support, streamline operations, and focus on what truly matters—their customers and their growth. Our Values Accessibility – We make advanced AI simple and usable for everyone. Empowerment – We enable businesses to automate and grow on their own terms. Innovation – We continuously explore new ways to solve real-world problems. Simplicity – We design intuitive tools that work without complexity. Customer-Centricity – We listen closely and build solutions around real needs. Reliability – We deliver stable, dependable technology you can trust. Book free consultationOur TeamAt the heart of HiQSense is a multidisciplinary team of passionate innovators and builders.Azar ObeidatCo-Founder & CEO Drives HiQSense forward with a vision to make advanced AI accessible and impactful for small businesses. Crafts intuitive interfaces with a focus on user experienceMarwan KhanfarCTO & Co-FounderLeads technology innovation at HiQSense Crafts intuitive interfaces with a focus on user experienceMohammad MelhemCo-Founder - Business Development & StrategiesDrives strategic growth with deep market insight and relentless focus on impact. Schedule a Call with HiQSense",
          "contactInfo": {
            "emails": [
              "hiqsense@hiqsense.ca"
            ],
            "phones": [],
            "addresses": [],
            "phoneDetails": []
          },
          "technologies": [],
          "socialLinks": {
            "linkedin": "https://linkedin.com/in/azarobeidat"
          },
          "keywords": [
            "About Us",
            "About HiQSense",
            "Our Vision",
            "Our Values",
            "Our Team",
            "Azar Obeidat",
            "Marwan Khanfar",
            "Mohammad Melhem",
            "Schedule a Call with HiQSense"
          ]
        },
        {
          "url": "https://hiqsense.com/contact",
          "status": "success",
          "duration": 0,
          "title": "Contact HiQSense | Web & AI Solutions in Saskatoon | HiQSense Smart Systems LTD",
          "description": "We’d love to learn more about your business. Reach out to explore how we can help.",
          "content": "HomeAbout UsFAQContactBook free consultationGet in TouchWe’d love to learn more about your business. Reach out to explore how we can help. Send Us a MessageConnect With UsHave a question or ready to get started? You can reach us by phone, email, or by visiting our Saskatoon office.Phone+1 306 261 8582Emailinfo@hiqsense.caAddress400-111 2nd Ave S , Saskatoon, SK, CA S7K 1K6Follow UsFirst Name *Last Name Email Address *Phone Number Company Message *I agree to the terms and conditions * Solve the math problemVerify you're human8 - 3 = ? Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
          "contactInfo": {
            "emails": [
              "info@hiqsense.ca",
              "hiqsense@hiqsense.ca"
            ],
            "phones": [
              "+13062618582"
            ],
            "addresses": [],
            "phoneDetails": [
              {
                "number": "+13062618582",
                "source": "tel",
                "snippet": "+1 306 261 8582"
              }
            ]
          },
          "technologies": [],
          "socialLinks": {
            "facebook": "https://www.facebook.com/hiqsense/",
            "linkedin": "https://www.linkedin.com/company/hiqsense"
          },
          "keywords": [
            "Get in Touch",
            "Send Us a Message",
            "Connect With Us",
            "Solve the math problem",
            "Schedule a Call with HiQSense"
          ]
        },
        {
          "url": "https://hiqsense.com/terms-of-service",
          "status": "success",
          "duration": 0,
          "title": "Terms of Service | HiQSense in Saskatoon | HiQSense Smart Systems LTD",
          "description": "Effective Date: March 28, 2025",
          "content": "HomeAbout UsFAQContactBook free consultation Terms of Service Effective Date: March 28, 2025 This Terms of Service agreement (\"Agreement\") is entered into by and between HiQSense Smart Systems LTD (\"HiQSense\", \"we\", \"us\", or \"our\"), a Canadian-registered corporation, and any person or entity (\"you\" or \"your\") accessing or using our website, digital products, or custom software and automation services. By accessing our website or engaging our services, you acknowledge that you have read, understood, and agree to be bound by these terms. If you do not agree, please discontinue use of our website and services. 1. Use of Services Our services are intended for lawful business use. You agree not to use our website, platforms, or delivered systems for any unlawful activity or to violate any local, provincial, national, or international regulations. 2. Project Engagement and Scope All services begin with a discovery or consultation phase. Based on your business needs, we prepare a custom scope of work and formal quote. No project will commence until both parties agree in writing to the proposal, deliverables, and payment structure. 3. Pricing and Payment Terms HiQSense does not offer flat-rate pricing. All costs are project-specific and depend on the scope, complexity, and duration of the engagement. Payment terms, including deposits, installment schedules, and final payments, will be detailed in the proposal or service agreement. Late payments may delay delivery or incur additional charges. 4. Ownership and Licensing Unless otherwise agreed in writing, all custom-built code, workflows, or software solutions developed under a paid contract become the property of the client upon final payment. HiQSense retains the right to reuse general frameworks or non-client-specific utilities developed independently. 5. Confidentiality We maintain strict confidentiality over all materials, communications, and proprietary business or technical information shared with us. We will not disclose your data, ideas, designs, or internal systems to any third party without prior consent. 6. Hosting and Maintenance Hosting, updates, and technical support are not included by default. These services may be added under an Annual Maintenance Contract (AMC), which covers hosting management, software updates, minor modifications, and troubleshooting. 7. Limitations of Liability HiQSense makes every effort to build secure, reliable systems. However, we do not guarantee uninterrupted or error-free operation and are not liable for losses resulting from downtime, third-party service interruptions, or client-side misuse. Our liability is limited to the total fees paid under the specific service agreement. 8. Termination Either party may terminate an agreement with written notice. In the event of early termination by the client, any work completed to date will be invoiced and due. HiQSense reserves the right to suspend service or access in case of non-payment or violation of these terms. 9. Governing Law This Agreement is governed by the laws of the Province of Saskatchewan and applicable federal laws of Canada. Any disputes arising out of this Agreement shall be resolved through mediation or the courts of Saskatchewan. 10. Contact If you have questions about these terms, please contact us:HiQSense Smart Systems LTD400 – 111 2nd Ave S, Saskatoon, SK, S7K 1K6Email: info@hiqsense.caPhone: +1 306 261 8582 Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
          "contactInfo": {
            "emails": [
              "info@hiqsense.ca",
              "hiqsense@hiqsense.ca"
            ],
            "phones": [
              "+13062618582"
            ],
            "addresses": [],
            "phoneDetails": [
              {
                "number": "+13062618582",
                "source": "tel",
                "snippet": "+1 306 261 8582"
              }
            ]
          },
          "technologies": [],
          "socialLinks": {
            "facebook": "https://www.facebook.com/hiqsense/",
            "linkedin": "https://www.linkedin.com/company/hiqsense"
          },
          "keywords": [
            "Terms of Service",
            "1. Use of Services",
            "2. Project Engagement and Scope",
            "3. Pricing and Payment Terms",
            "4. Ownership and Licensing",
            "5. Confidentiality",
            "6. Hosting and Maintenance",
            "7. Limitations of Liability",
            "8. Termination",
            "9. Governing Law",
            "10. Contact",
            "Schedule a Call with HiQSense"
          ]
        },
        {
          "url": "https://hiqsense.com/sitemap-pages.xml",
          "status": "success",
          "duration": 0,
          "title": "XML Sitemap - Pages",
          "description": "This sitemap contains all the main pages of our website.",
          "content": "XML Sitemap - Pages This sitemap contains all the main pages of our website. You can find more information about XML sitemaps on sitemaps.org. ← Back to Sitemap Index Pages Overview: This sitemap contains 6 pages, last updated on 2025-08-13 02:44:36 +00:00. Page URL Priority Change Frequency Last Modified https://hiqsense.com/about-us 0.7 monthly 2025-07-30 01:13:23 +00:00 https://hiqsense.com/contact 0.7 monthly 2025-07-30 01:14:13 +00:00 https://hiqsense.com/faq 0.8 weekly 2025-07-30 01:13:46 +00:00 https://hiqsense.com/home 1.0 weekly 2025-07-30 01:12:18 +00:00 https://hiqsense.com/privacy-policy 0.7 monthly 2025-07-30 01:15:11 +00:00 https://hiqsense.com/terms-of-service 0.7 monthly 2025-07-30 01:14:51 +00:00",
          "contactInfo": {
            "emails": [],
            "phones": [
              "2025081302",
              "2025073001"
            ],
            "addresses": [],
            "phoneDetails": [
              {
                "number": "2025081302",
                "source": "text",
                "snippet": "x Pages Overview: This sitemap contains 6 pages, last updated on 2025-08-13 02:44:36 +00:00. Page URL Priority Ch"
              },
              {
                "number": "2025073001",
                "source": "text",
                "snippet": "ps://hiqsense.com/about-us 0.7 monthly 2025-07-30 01:13:23 +00:00 https://hiqsense.com/cont"
              }
            ]
          },
          "technologies": [],
          "socialLinks": {},
          "keywords": [
            "XML Sitemap - Pages",
            "Pages Overview:"
          ]
        },
        {
          "url": "https://hiqsense.com/sitemap.xml",
          "status": "success",
          "duration": 0,
          "title": "",
          "description": "",
          "content": "https://hiqsense.com/sitemap-pages.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-faq-categories.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-faq-questions.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-images.xml 2025-08-13T02:35:56.429Z This XML file does not appear to have any style information associated with it. The document tree is shown below.<sitemapindex xmlns=\"http://www.sitemaps.org/schemas/sitemap/0.9\"> <sitemap> <loc>https://hiqsense.com/sitemap-pages.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-faq-categories.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-faq-questions.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-images.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> ...</sitemapindex>",
          "contactInfo": {
            "emails": [],
            "phones": [],
            "addresses": [],
            "phoneDetails": []
          },
          "technologies": [],
          "socialLinks": {},
          "keywords": []
        },
        {
          "url": "https://hiqsense.com/faq",
          "status": "success",
          "duration": 0,
          "title": "FAQs | HiQSense Services & AI Development in Saskatoon | HiQSense Smart Systems LTD",
          "description": "",
          "content": "HomeAbout UsFAQContactBook free consultationFrequently Asked QuestionsQuick NavigationGot Questions ? Let's Find an Answer Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
          "contactInfo": {
            "emails": [
              "info@hiqsense.ca",
              "hiqsense@hiqsense.ca"
            ],
            "phones": [
              "+13062618582"
            ],
            "addresses": [],
            "phoneDetails": [
              {
                "number": "+13062618582",
                "source": "tel",
                "snippet": "+1 306 261 8582"
              }
            ]
          },
          "technologies": [
            "Shopify",
            "WooCommerce",
            "React",
            "Tailwind",
            "AWS",
            "Google Cloud",
            "Stripe",
            "HubSpot"
          ],
          "socialLinks": {
            "facebook": "https://www.facebook.com/hiqsense/",
            "linkedin": "https://www.linkedin.com/company/hiqsense"
          },
          "keywords": [
            "Frequently Asked Questions",
            "Quick Navigation",
            "Got Questions ? Let's Find an Answer",
            "Schedule a Call with HiQSense"
          ]
        },
        {
          "url": "https://hiqsense.com/privacy-policy",
          "status": "success",
          "duration": 0,
          "title": "Privacy Policy | HiQSense Smart Systems LTD | HiQSense Smart Systems LTD",
          "description": "Effective Date: March 28, 2025",
          "content": "HomeAbout UsFAQContactBook free consultation Privacy Policy Effective Date: March 28, 2025 HiQSense Smart Systems LTD (\"HiQSense\", \"we\", \"our\", or \"us\") is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you interact with our website or services. 1. Information We Collect Personal Information: When you fill out forms, book consultations, or work with us, we may collect your name, email, phone number, and relevant business information. Technical Information: We may collect anonymized data such as IP address, browser type, device type, and browsing behavior using analytics tools like Google Analytics or Hotjar to improve user experience. Project Files & Data: If you provide documents, designs, APIs, databases, or content to complete your project, this information is treated as strictly confidential and is used only for the purpose of delivering the contracted services. 2. How We Use Your Information To communicate with you regarding your inquiry, consultation, or project To assess and deliver the services you request To improve our website and service offerings To manage billing and client accounts To comply with legal and regulatory obligations 3. Sharing of Information We do not sell, trade, or rent your personal information to third parties. We may share information with trusted partners only when necessary to operate our business—such as hosting providers (AWS, GCP, Heroku), payment processors (Stripe), or communication tools (Twilio, Calendly). These partners are required to protect your data in accordance with their own privacy policies and data protection laws. 4. Data Security We implement reasonable administrative, technical, and physical safeguards to protect your information from unauthorized access, use, or disclosure. This includes secure storage, access control, encryption, and regular security audits. 5. Data Retention We retain your information for as long as necessary to provide services and as required by law. You may request deletion of your personal data or project files at any time, unless retention is required for legal or operational reasons. 6. Your Rights You have the right to request access to your personal data, correct inaccuracies, or ask us to delete your information. To make such a request, please contact us using the details below. 7. Changes to This Policy We may update this Privacy Policy to reflect changes to our practices or legal obligations. Updates will be posted on this page with the revised effective date. 8. Contact If you have any questions or concerns about this policy, please contact us: HiQSense Smart Systems LTD 400 – 111 2nd Ave S, Saskatoon, SK, S7K 1K6 Email: info@hiqsense.ca Phone: +1 306 261 8582 Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
          "contactInfo": {
            "emails": [
              "info@hiqsense.ca",
              "hiqsense@hiqsense.ca"
            ],
            "phones": [
              "+13062618582"
            ],
            "addresses": [],
            "phoneDetails": [
              {
                "number": "+13062618582",
                "source": "tel",
                "snippet": "+1 306 261 8582"
              }
            ]
          },
          "technologies": [
            "AWS",
            "Stripe"
          ],
          "socialLinks": {
            "facebook": "https://www.facebook.com/hiqsense/",
            "linkedin": "https://www.linkedin.com/company/hiqsense"
          },
          "keywords": [
            "Privacy Policy",
            "1. Information We Collect",
            "2. How We Use Your Information",
            "3. Sharing of Information",
            "4. Data Security",
            "5. Data Retention",
            "6. Your Rights",
            "7. Changes to This Policy",
            "8. Contact",
            "Schedule a Call with HiQSense"
          ]
        }
      ]
    },
    "googleData": {
      "searchResults": [
        {
          "title": "Smart Track for Telecom and Electronics Services | LinkedIn",
          "link": "https://www.linkedin.com/company/smarttrackjor",
          "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan · GPS.AZ. IT Services and IT Consulting · The Ritz-Carlton, Amman. Hospitality ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "LightLeaf Solar | LinkedIn",
          "link": "https://ca.linkedin.com/company/lightleafsolar",
          "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan · AgriReach. Software Development · Bright Autonomy. Automation Machinery ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "ABAzyne Bioscience Inc. | LinkedIn",
          "link": "https://www.linkedin.com/company/abazyne-bioscience-inc",
          "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan. Show more similar pages. Show fewer similar pages. Browse jobs. User Experience ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "VistaPM by Vistaraa IT | LinkedIn",
          "link": "https://ca.linkedin.com/company/vistaraait",
          "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan · AgriReach. Software Development · Laroye AI. Software Development. Regina, ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Mieyar | LinkedIn",
          "link": "https://www.linkedin.com/company/mieyarae",
          "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan. Originova. IT Services and IT Consulting. FreshNow.ae. Food and Beverage Services.",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Azar Obeidat - Founder at HiQSense | LinkedIn",
          "link": "https://ca.linkedin.com/in/azarobeidat",
          "snippet": "Founder at HiQSense. Hiqsense Smart Systems LTD Jordan University of Science & Technolgy. Saskatoon, Saskatchewan, Canada. 2K followers 500+ connections. See ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "تقوم شركة Hiqsense Smart Systems LTD بالتوظيف لوظيفة Digital ...",
          "link": "https://jo.linkedin.com/jobs/view/digital-marketing-specialist-at-hiqsense-smart-systems-ltd-4215283723",
          "snippet": "HiQSense Smart Systems LTD empowers small businesses with advanced AI solutions to automate tasks and reduce operational costs. Our flagship platform, Saski AI, ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Mohammad Melhem‏ - ‏Executive Director at Kabri International Co ...",
          "link": "https://ae.linkedin.com/in/mohammad-melhem",
          "snippet": "رسم بياني Hiqsense Smart Systems LTD. Co-Founder. Hiqsense Smart Systems LTD. سبتمبر ٢٠٢٤⁦ ⁩ - الحالي 1 عام واحد. Business Development Manager. Kabri ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Suresh Soundararajan - Project Manager at ABU HATIM CO LLC ...",
          "link": "https://www.linkedin.com/in/suresh-soundararajan-2b866752",
          "snippet": "Construction of Pre Engineered Building of Area 28000 Sqm for a Warehouse in a Land Extent of 44000 Sqm. The Steel Structure was supplied by M/s Zamil Steel ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Jamal AL-Zain - PROJECT MANAGER | LinkedIn",
          "link": "https://www.linkedin.com/in/engineerjamalalzain",
          "snippet": "PROJECT MANAGER · PROJECT MANAGER · Experience: Beit Hanina for contracting · Education: Kiev-National-University-of-Construction-and-Architecture ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏mahmoud awad‏ - ‏Project Manager PMP®‏ | LinkedIn",
          "link": "https://ae.linkedin.com/in/mahmoud-awad-45b13843",
          "snippet": "الخبرة · Project Manager. Lazourdy Contracting and General Maintenance. يونيو ٢٠١٩⁦ ⁩ - الحالي 6 عام 3 شهر. Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Aidan Suckling - Project Manager at Naylor Love | LinkedIn",
          "link": "https://nz.linkedin.com/in/aidan-suckling-8b082a20",
          "snippet": "Education · Canterbury University. BE (hons) Engineering. 2000 - 2003 · Otago Polytechnic. NZCE Mechanical Engineering. 1997 - 1999 ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Suzanne Hussey - Ballymore | LinkedIn",
          "link": "https://ie.linkedin.com/in/suzanne-hussey-7a1b0217",
          "snippet": "Experienced project manager directing multi-million value residential, commercial and… · Experience: Ballymore · Education: Trinity College, ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Joe Fakhoury - Project Manager | Development Manager ...",
          "link": "https://www.linkedin.com/in/joe-fakhoury-85288050",
          "snippet": "Professional Engineer with over 15 years of experience managing large scale projects ranging from high end residential towers, hotels and mixed use ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "John Deenihan Ph.D, PMP, B.A., B.A.I., CEng MIEI - TOBIN | LinkedIn",
          "link": "https://ie.linkedin.com/in/johndeenihan",
          "snippet": "Inelastic Performance of High Strength Concrete Composite Columns Subject to Earthquake Loading Conditions. 14th European Conference on Earthquake Engineering, ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Pankaj Shringarpure - Project Manager at Bin Ham Electro ...",
          "link": "https://www.linkedin.com/in/pankaj-shringarpure-a3a47823",
          "snippet": "Gained first hand experience in various office administrative functions as logistics, material management, visas, accounting and finance functions and basis IT ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Gert Olivier - Project Manager at McConnell Dowell | LinkedIn",
          "link": "https://au.linkedin.com/in/gert-olivier-a629ab39",
          "snippet": "... Free State · Location: Narangba · 500+ connections on LinkedIn. View Gert ... I also compiled Technical Bids for several Tenders from the regional office in Dubai ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Companies starting with 'H'",
          "link": "https://ca.linkedin.com/directory/companies/h",
          "snippet": "HPDG Associés inc. Holiday Inn Toronto International Airport · HOPE International Development Agency · HydroFLOW® Canada · Hiqsense Smart Systems LTD · Hiregood ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Ivan Kucherenko,MCIOB - Project Manager at PMKConsult | LinkedIn",
          "link": "https://ae.linkedin.com/in/kucherenkoivan/en",
          "snippet": "Develop a financial model in collaboration with Partnerships & Investment and other relevant functions. • Manage developments from inception to completion ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Khaled Farchoukh‏ - ‏PMP, MEM‏ | LinkedIn",
          "link": "https://ae.linkedin.com/in/khaled-farchoukh-217b03185",
          "snippet": "Bonyan International Investment Group (Holding) LLC ... Financial Management and Leading in Contemporary Organizations.",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Hossam Abbas‏ - A Member of National Gulf Investments",
          "link": "https://ae.linkedin.com/in/hossam-abbas-19288259",
          "snippet": "Project Manager at National Gulf Constructions - A Member of National Gulf Investments‏ · ‏Dear Sir/Madam Good Day With this letter and resume, ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Hassan Ali‏ - ‏Project Manager‏ | LinkedIn",
          "link": "https://ae.linkedin.com/in/hassan-ali-4b6460171",
          "snippet": "4 عام 7 شهر. Abu Dhabi, United Arab Emirates. Project: Al Saadiyat Villas Development Client: TDIC (Tourism Development & Investment Company) Project Value ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Pran Bhuiyan‏ - ‏Oracle‏ | LinkedIn",
          "link": "https://ae.linkedin.com/in/pran-bhuiyan-9a49b128",
          "snippet": "A PRINCE2 Project Manager and Civil Engineer with over thirteen years experience in…‏ · الخبرة: ‏Oracle‏ · الموقع: ‏ميلبورن‏ · أكثر من ٥٠٠ زميل على LinkedIn ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Gowsik Roshan Vijayan‏ - ‏Project Manager - PMP® - MBA (FM), CIE ...",
          "link": "https://ae.linkedin.com/in/gowsik-roshan-vijayan-a03544111",
          "snippet": "Master of Business Administration - MBA Finance and Financial Management Services. ٢٠٢٠ - ٢٠٢٢. S.L.B Higher Secondary School. Computer Science. ٢٠٠٤ - ٢٠١٠.",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Thomas Dieball‏ - ‏Manager - Business Development Asia Pacific at ...",
          "link": "https://ae.linkedin.com/in/thomas-dieball-85382518",
          "snippet": "٢٠٠٤ - ٢٠٠٩. التراخيص والشهادات. Diploma of Project Management - Cert. IV. TAFE. Engineer in Training. Illinois Department of Financial & Professional ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Remon Faltas‏ - ‏Technical Manager at East Coast Contracting And ...",
          "link": "https://ae.linkedin.com/in/remon-faltas-498b1365",
          "snippet": "Site Engineer for Inter-Continental Construction and Tourism Investment (S.A.E). التعليم. رسم بياني Alexandria University · Alexandria University. bachelor's ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Abdelhadi Albashtawi - Project Manager | LinkedIn",
          "link": "https://ca.linkedin.com/in/abdelhadi-albashtawi-296459b3",
          "snippet": "Proficient in the management of all types of construction projects with the project cost review, project design review, budgeting, estimating and tendering.",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Mario Manipol - Project Manager at Gunn Lennon Fabrication ...",
          "link": "https://ie.linkedin.com/in/mario-manipol-5385b395",
          "snippet": "Consulting. Engineering) as Senior QA/QC Facade Consultant who do review and research options for the Design Drawings; Prepare detailed Method Statement and ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Muhammad Majid Samin - Technical Advisor @ Roads and ...",
          "link": "https://au.linkedin.com/in/muhammad-majid-samin-26325a20",
          "snippet": "Handing Over, Final and End of Defects Liability Inspections for major and minor road network in Dubai, Preliminary design reviews, of road projects, Issuance ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Christopher Murgia - General Manager (QLD) at West to West Group ...",
          "link": "https://www.linkedin.com/in/christopher-murgia-107ab2b0",
          "snippet": "Subcontract and supplier procurement. Façade works management. Field support to Site Managers. Preparation of Project Safety Plan and ongoing review and ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Matias Borquez - Project Manager, PMP / Civil Engineer | LinkedIn",
          "link": "https://ae.linkedin.com/in/matias-borquez-mb/en",
          "snippet": "Identification of risks. • Procurement. • Communication with stakeholders. • Review of structural and other technical submittals. • Construction management ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Adnan Syed‏ - ‏Regional After Sales Manager at Linx Printing ...",
          "link": "https://ae.linkedin.com/in/adnan-syed-pmp",
          "snippet": "Regional After Sales Manager at Linx Printing Technologies‏ · ‏Ever had a super active classmate who was always organizing events, leading clubs ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Shashank bhardwaj‏ - ‏Project Director - Corporate Principal at ...",
          "link": "https://ae.linkedin.com/in/shashank-bhardwaj-40324925",
          "snippet": "Karnataka State Open University. B-Tech in Civil Engineering. ٢٠١١ - ٢٠١٤. Board of Technical Education New Delhi. Civil Engineering Civil Engineering. ٢٠٠١ - ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Mubashir Uddin‏ - ‏Project Manager at QWAED CONTRACTING L.L.C ...",
          "link": "https://ae.linkedin.com/in/mubashiruddin",
          "snippet": "... Technology‏ · الموقع: ‏الإمارات العربية المتحدة‏ · أكثر من ٥٠٠ زميل على ... Using planning software namely; M.S project to plan the work and cost ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏Abdelazim Sherif‏ - ‏Senior Associate - Head of Structures‏ | LinkedIn",
          "link": "https://ae.linkedin.com/in/abdelazim-sherif-20642414",
          "snippet": "... solutions for their needs. I mentors mid level and junior structural engineers in utilizing advanced computer software such as SAP, ETABS, SAFE, STAAD ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "‏MOINUDDIN ANSARI‏ - ‏PMP | Project & Construction Management ...",
          "link": "https://ae.linkedin.com/in/moinuddin-ansari-b3682258",
          "snippet": "Key highlights of my career include: Spearheading the development and delivery of a $3 billion healthcare facility, setting new benchmarks in project execution ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Majd Abudagga - Account Executive - Autodesk Construction Cloud ...",
          "link": "https://au.linkedin.com/in/majd-abudagga-9331b047",
          "snippet": "Join now Sign in. Majd Abudagga. Expand search. People. This button displays ... Majd's career began in construction engineering, where he contributed to ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Luke Konia - Project Manager and Engineer, Civil Construction ...",
          "link": "https://pg.linkedin.com/in/luke-konia-9aabb651",
          "snippet": "Join now Sign in. Luke Konia. Expand search. People. This button displays the currently selected search type. When expanded it provides a list of search options ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Joseph Gonsalves - Project Manager at Turner Construction ...",
          "link": "https://in.linkedin.com/in/jsg180558",
          "snippet": "Join now Sign in. Joseph Gonsalves. Expand search. People. This button displays the currently selected search type. When expanded it provides a list of search ...",
          "source": "LinkedIn",
          "relevance": 1
        },
        {
          "title": "Saski AI Integration – WordPress plugin | WordPress.org Slovensko",
          "link": "https://sk.wordpress.org/plugins/saski-ai-integration/",
          "snippet": "... on your website. Service Used: Saski AI Widget and API, provided by HiQSense Smart Systems LTD; Purpose: To render an AI-powered assistant that interacts ...",
          "source": "News",
          "relevance": 0.7
        },
        {
          "title": "HiQSense Smart Systems LTD: HiQSense | AI & Automation for ...",
          "link": "https://hiqsense.com/",
          "snippet": "HiQSense is a Canadian company specializing in web design, web development, AI-powered applications, and mobile app solutions. We help small businesses ...",
          "source": "Other",
          "relevance": 0.2
        },
        {
          "title": "Hiqsense Smart Systems | Saskatoon SK",
          "link": "https://www.facebook.com/hiqsense/",
          "snippet": "Hiqsense Smart Systems, Saskatoon. 1203 likes. Empowering businesses with top-tier web and graphic design, SEO, and email at affordable prices.",
          "source": "Other",
          "relevance": 0.2
        },
        {
          "title": "Has anyone found any good AI chatbots that can access user ...",
          "link": "https://www.reddit.com/r/woocommerce/comments/1kzing7/has_anyone_found_any_good_ai_chatbots_that_can/",
          "snippet": "May 30, 2025 ... WP Bot - lots of good reviews. Build your own - looks cool. Here's ... HiQSense. • 4d ago. Yes , Saski AI https://youtu.be/1yr9Mc5y-Ds?si ...",
          "source": "Other",
          "relevance": 0.2
        },
        {
          "title": "Which are the top three AI supported chatbots for Woocomerce : r ...",
          "link": "https://www.reddit.com/r/woocommerce/comments/1kf4rrp/which_are_the_top_three_ai_supported_chatbots_for/",
          "snippet": "May 5, 2025 ... Comments Section. AuGKlasD. • 3mo ago ... HiQSense. • 4d ago. Have you checked this ? https://youtu.be/1yr9Mc5y ...",
          "source": "Other",
          "relevance": 0.2
        },
        {
          "title": "Web Development Services | Harshil Khimasia - Freelance Web ...",
          "link": "https://harshilkhimasia.com/",
          "snippet": "Tech Stack. Tools & Technologies. Here are the tools and technologies I use ... Hiqsense Solutions. \"He is one of the best freelancers I have every worked ...",
          "source": "Other",
          "relevance": 0.2
        },
        {
          "title": "Hiqsense Smart Systems LTD - - Remote Job -",
          "link": "https://www.facebook.com/hiqsense/posts/hiqsense-smart-systems-ltd-remote-job-/122121307568231512/",
          "snippet": "Mar 25, 2024 ... Hiqsense Smart Systems LTD - - Remote Job - ... Just shared a quick whiteboard explainer of Saski AI — our no-code platform built to help small ...",
          "source": "Other",
          "relevance": 0.2
        }
      ],
      "extractedInfo": {
        "news": [
          "Saski AI Integration – WordPress plugin | WordPress.org Slovensko"
        ],
        "reviews": []
      },
      "lastSearched": "2025-08-13T03:14:05.680Z"
    },
    "linkedinData": null,
    "crunchbaseData": null,
    "llmData": {
      "company": {
        "legalName": "HiQSense Smart Systems LTD",
        "dba": "HiQSense",
        "industry": "Software Development",
        "description": "HiQSense empowers small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. The company specializes in web design, web development, AI-powered applications, and mobile app solutions."
      },
      "business": {
        "targetCustomers": [
          "Small and medium-sized businesses"
        ],
        "funding": [],
        "revenue": "Unknown",
        "founded": "Unknown",
        "categories": [
          "AI & Automation",
          "Web Design",
          "Web Development",
          "Mobile Apps",
          "Process Automation"
        ]
      },
      "people": {
        "executives": [
          {
            "name": "Azar Obeidat",
            "title": "Founder",
            "linkedin": "https://linkedin.com/in/azarobeidat"
          }
        ],
        "employeeCount": "Unknown"
      },
      "technology": {
        "platforms": [
          "React",
          "Shopify",
          "WooCommerce"
        ],
        "tools": [
          "Stripe",
          "HubSpot"
        ],
        "infrastructure": [
          "AWS",
          "Google Cloud"
        ]
      },
      "market": {
        "targetCustomers": [
          "Small and medium-sized businesses"
        ],
        "competitors": [],
        "geographic": [
          "Saskatchewan, Canada"
        ]
      },
      "processedAt": "2025-08-13T03:14:44.770Z",
      "confidence": 0.8
    },
    "consolidatedData": {
      "companyName": "HiQSense Smart Systems LTD",
      "legalName": "HiQSense Smart Systems LTD",
      "dba": "HiQSense",
      "description": "HiQSense empowers small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. The company specializes in web design, web development, AI-powered applications, and mobile app solutions.",
      "founded": null,
      "website": "https://hiqsense.com",
      "contact": {
        "email": "hiqsense@hiqsense.ca",
        "phone": "+13062618582",
        "address": {
          "street": "",
          "city": "",
          "state": "",
          "zipCode": "",
          "country": ""
        },
        "socialMedia": {
          "linkedin": "https://linkedin.com/in/azarobeidat",
          "twitter": "",
          "facebook": "https://www.facebook.com/hiqsense/",
          "instagram": ""
        }
      },
      "business": {
        "industry": "Software Development",
        "sector": "",
        "employeeRange": "Unknown",
        "revenue": "Unknown",
        "funding": [],
        "isPublic": false,
        "stockSymbol": ""
      },
      "technology": {
        "platforms": [
          "React",
          "Shopify",
          "WooCommerce",
          "React",
          "Shopify",
          "WooCommerce",
          "Tailwind",
          "AWS",
          "Google Cloud",
          "Stripe",
          "HubSpot"
        ],
        "tools": [
          "Stripe",
          "HubSpot"
        ],
        "infrastructure": [
          "AWS",
          "Google Cloud"
        ],
        "languages": [],
        "databases": []
      },
      "people": {
        "executives": [
          {
            "name": "Azar Obeidat",
            "title": "Founder",
            "linkedin": "https://linkedin.com/in/azarobeidat"
          }
        ],
        "keyDepartments": []
      },
      "market": {
        "targetCustomers": [
          "Small and medium-sized businesses"
        ],
        "competitors": [],
        "uniqueValue": "",
        "keywords": [
          "Empowering Small Businesses with AI and Smart Automation",
          "About HiQSense",
          "Introducing Saski AI — Our Flagship Platform",
          "Frequently Asked Questions",
          "Schedule a Call with HiQSense",
          "About Us",
          "Our Vision",
          "Our Values",
          "Our Team",
          "Azar Obeidat",
          "Marwan Khanfar",
          "Mohammad Melhem",
          "Get in Touch",
          "Send Us a Message",
          "Connect With Us",
          "Solve the math problem",
          "Terms of Service",
          "1. Use of Services",
          "2. Project Engagement and Scope",
          "3. Pricing and Payment Terms",
          "4. Ownership and Licensing",
          "5. Confidentiality",
          "6. Hosting and Maintenance",
          "7. Limitations of Liability",
          "8. Termination",
          "9. Governing Law",
          "10. Contact",
          "XML Sitemap - Pages",
          "Pages Overview:",
          "Quick Navigation",
          "Got Questions ? Let's Find an Answer",
          "Privacy Policy",
          "1. Information We Collect",
          "2. How We Use Your Information",
          "3. Sharing of Information",
          "4. Data Security",
          "5. Data Retention",
          "6. Your Rights",
          "7. Changes to This Policy",
          "8. Contact"
        ]
      },
      "rawData": {
        "website": {
          "title": "HiQSense | AI & Automation for Small Businesses | HiQSense Smart Systems LTD",
          "description": "From web design to AI implementation",
          "keywords": [
            "Empowering Small Businesses with AI and Smart Automation",
            "About HiQSense",
            "Introducing Saski AI — Our Flagship Platform",
            "Frequently Asked Questions",
            "Schedule a Call with HiQSense",
            "About Us",
            "Our Vision",
            "Our Values",
            "Our Team",
            "Azar Obeidat",
            "Marwan Khanfar",
            "Mohammad Melhem",
            "Get in Touch",
            "Send Us a Message",
            "Connect With Us",
            "Solve the math problem",
            "Terms of Service",
            "1. Use of Services",
            "2. Project Engagement and Scope",
            "3. Pricing and Payment Terms",
            "4. Ownership and Licensing",
            "5. Confidentiality",
            "6. Hosting and Maintenance",
            "7. Limitations of Liability",
            "8. Termination",
            "9. Governing Law",
            "10. Contact",
            "XML Sitemap - Pages",
            "Pages Overview:",
            "Quick Navigation",
            "Got Questions ? Let's Find an Answer",
            "Privacy Policy",
            "1. Information We Collect",
            "2. How We Use Your Information",
            "3. Sharing of Information",
            "4. Data Security",
            "5. Data Retention",
            "6. Your Rights",
            "7. Changes to This Policy",
            "8. Contact"
          ],
          "content": "Empowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense\n\nEmpowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense\n\nEmpowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense\n\nAbout UsHiQSense is a Canadian technology company based in Saskatchewan. Our mission is to empower small businesses by making AI accessible, useful, and easy to implement.​About HiQSense Our Vision We envision a future where small businesses can harness the power of AI to operate efficiently, reduce costs, and grow sustainably—without needing technical expertise. At HiQSense, we’re committed to building smart, accessible tools that simplify complex tasks. Through innovations like Saski AI, we empower business owners to automate customer support, streamline operations, and focus on what truly matters—their customers and their growth. Our Values Accessibility – We make advanced AI simple and usable for everyone. Empowerment – We enable businesses to automate and grow on their own terms. Innovation – We continuously explore new ways to solve real-world problems. Simplicity – We design intuitive tools that work without complexity. Customer-Centricity – We listen closely and build solutions around real needs. Reliability – We deliver stable, dependable technology you can trust. Book free consultationOur TeamAt the heart of HiQSense is a multidisciplinary team of passionate innovators and builders.Azar ObeidatCo-Founder & CEO Drives HiQSense forward with a vision to make advanced AI accessible and impactful for small businesses. Crafts intuitive interfaces with a focus on user experienceMarwan KhanfarCTO & Co-FounderLeads technology innovation at HiQSense Crafts intuitive interfaces with a focus on user experienceMohammad MelhemCo-Founder - Business Development & StrategiesDrives strategic growth with deep market insight and relentless focus on impact. Schedule a Call with HiQSense\n\nHomeAbout UsFAQContactBook free consultationGet in TouchWe’d love to learn more about your business. Reach out to explore how we can help. Send Us a MessageConnect With UsHave a question or ready to get started? You can reach us by phone, email, or by visiting our Saskatoon office.Phone+1 306 261 8582Emailinfo@hiqsense.caAddress400-111 2nd Ave S , Saskatoon, SK, CA S7K 1K6Follow UsFirst Name *Last Name Email Address *Phone Number Company Message *I agree to the terms and conditions * Solve the math problemVerify you're human8 - 3 = ? Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD\n\nHomeAbout UsFAQContactBook free consultation Terms of Service Effective Date: March 28, 2025 This Terms of Service agreement (\"Agreement\") is entered into by and between HiQSense Smart Systems LTD (\"HiQSense\", \"we\", \"us\", or \"our\"), a Canadian-registered corporation, and any person or entity (\"you\" or \"your\") accessing or using our website, digital products, or custom software and automation services. By accessing our website or engaging our services, you acknowledge that you have read, understood, and agree to be bound by these terms. If you do not agree, please discontinue use of our website and services. 1. Use of Services Our services are intended for lawful business use. You agree not to use our website, platforms, or delivered systems for any unlawful activity or to violate any local, provincial, national, or international regulations. 2. Project Engagement and Scope All services begin with a discovery or consultation phase. Based on your business needs, we prepare a custom scope of work and formal quote. No project will commence until both parties agree in writing to the proposal, deliverables, and payment structure. 3. Pricing and Payment Terms HiQSense does not offer flat-rate pricing. All costs are project-specific and depend on the scope, complexity, and duration of the engagement. Payment terms, including deposits, installment schedules, and final payments, will be detailed in the proposal or service agreement. Late payments may delay delivery or incur additional charges. 4. Ownership and Licensing Unless otherwise agreed in writing, all custom-built code, workflows, or software solutions developed under a paid contract become the property of the client upon final payment. HiQSense retains the right to reuse general frameworks or non-client-specific utilities developed independently. 5. Confidentiality We maintain strict confidentiality over all materials, communications, and proprietary business or technical information shared with us. We will not disclose your data, ideas, designs, or internal systems to any third party without prior consent. 6. Hosting and Maintenance Hosting, updates, and technical support are not included by default. These services may be added under an Annual Maintenance Contract (AMC), which covers hosting management, software updates, minor modifications, and troubleshooting. 7. Limitations of Liability HiQSense makes every effort to build secure, reliable systems. However, we do not guarantee uninterrupted or error-free operation and are not liable for losses resulting from downtime, third-party service interruptions, or client-side misuse. Our liability is limited to the total fees paid under the specific service agreement. 8. Termination Either party may terminate an agreement with written notice. In the event of early termination by the client, any work completed to date will be invoiced and due. HiQSense reserves the right to suspend service or access in case of non-payment or violation of these terms. 9. Governing Law This Agreement is governed by the laws of the Province of Saskatchewan and applicable federal laws of Canada. Any disputes arising out of this Agreement shall be resolved through mediation or the courts of Saskatchewan. 10. Contact If you have questions about these terms, please contact us:HiQSense Smart Systems LTD400 – 111 2nd Ave S, Saskatoon, SK, S7K 1K6Email: info@hiqsense.caPhone: +1 306 261 8582 Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD\n\nXML Sitemap - Pages This sitemap contains all the main pages of our website. You can find more information about XML sitemaps on sitemaps.org. ← Back to Sitemap Index Pages Overview: This sitemap contains 6 pages, last updated on 2025-08-13 02:44:36 +00:00. Page URL Priority Change Frequency Last Modified https://hiqsense.com/about-us 0.7 monthly 2025-07-30 01:13:23 +00:00 https://hiqsense.com/contact 0.7 monthly 2025-07-30 01:14:13 +00:00 https://hiqsense.com/faq 0.8 weekly 2025-07-30 01:13:46 +00:00 https://hiqsense.com/home 1.0 weekly 2025-07-30 01:12:18 +00:00 https://hiqsense.com/privacy-policy 0.7 monthly 2025-07-30 01:15:11 +00:00 https://hiqsense.com/terms-of-service 0.7 monthly 2025-07-30 01:14:51 +00:00\n\nhttps://hiqsense.com/sitemap-pages.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-faq-categories.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-faq-questions.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-images.xml 2025-08-13T02:35:56.429Z This XML file does not appear to have any style information associated with it. The document tree is shown below.<sitemapindex xmlns=\"http://www.sitemaps.org/schemas/sitemap/0.9\"> <sitemap> <loc>https://hiqsense.com/sitemap-pages.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-faq-categories.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-faq-questions.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-images.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> ...</sitemapindex>\n\nHomeAbout UsFAQContactBook free consultationFrequently Asked QuestionsQuick NavigationGot Questions ? Let's Find an Answer Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD\n\nHomeAbout UsFAQContactBook free consultation Privacy Policy Effective Date: March 28, 2025 HiQSense Smart Systems LTD (\"HiQSense\", \"we\", \"our\", or \"us\") is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you interact with our website or services. 1. Information We Collect Personal Information: When you fill out forms, book consultations, or work with us, we may collect your name, email, phone number, and relevant business information. Technical Information: We may collect anonymized data such as IP address, browser type, device type, and browsing behavior using analytics tools like Google Analytics or Hotjar to improve user experience. Project Files & Data: If you provide documents, designs, APIs, databases, or content to complete your project, this information is treated as strictly confidential and is used only for the purpose of delivering the contracted services. 2. How We Use Your Information To communicate with you regarding your inquiry, consultation, or project To assess and deliver the services you request To improve our website and service offerings To manage billing and client accounts To comply with legal and regulatory obligations 3. Sharing of Information We do not sell, trade, or rent your personal information to third parties. We may share information with trusted partners only when necessary to operate our business—such as hosting providers (AWS, GCP, Heroku), payment processors (Stripe), or communication tools (Twilio, Calendly). These partners are required to protect your data in accordance with their own privacy policies and data protection laws. 4. Data Security We implement reasonable administrative, technical, and physical safeguards to protect your information from unauthorized access, use, or disclosure. This includes secure storage, access control, encryption, and regular security audits. 5. Data Retention We retain your information for as long as necessary to provide services and as required by law. You may request deletion of your personal data or project files at any time, unless retention is required for legal or operational reasons. 6. Your Rights You have the right to request access to your personal data, correct inaccuracies, or ask us to delete your information. To make such a request, please contact us using the details below. 7. Changes to This Policy We may update this Privacy Policy to reflect changes to our practices or legal obligations. Updates will be posted on this page with the revised effective date. 8. Contact If you have any questions or concerns about this policy, please contact us: HiQSense Smart Systems LTD 400 – 111 2nd Ave S, Saskatoon, SK, S7K 1K6 Email: info@hiqsense.ca Phone: +1 306 261 8582 Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
          "socialLinks": {
            "linkedin": "https://linkedin.com/in/azarobeidat",
            "facebook": "https://www.facebook.com/hiqsense/"
          },
          "contactInfo": {
            "emails": [
              "hiqsense@hiqsense.ca",
              "info@hiqsense.ca"
            ],
            "phones": [
              "+13062618582",
              "2025081302",
              "2025073001"
            ],
            "addresses": []
          },
          "technologies": [
            "React",
            "Shopify",
            "WooCommerce",
            "Tailwind",
            "AWS",
            "Google Cloud",
            "Stripe",
            "HubSpot"
          ],
          "lastScraped": "2025-08-13T03:13:53.512Z",
          "status": "success",
          "discoveredPages": [
            "https://hiqsense.com/",
            "https://hiqsense.com/contact",
            "https://hiqsense.com/home",
            "https://hiqsense.com/index",
            "https://hiqsense.com/about-us",
            "https://hiqsense.com/sitemap-pages.xml",
            "https://hiqsense.com/sitemap.xml",
            "https://hiqsense.com/faq",
            "https://hiqsense.com/privacy-policy",
            "https://hiqsense.com/terms-of-service"
          ],
          "categorizedPages": {
            "home": [
              "https://hiqsense.com/",
              "https://hiqsense.com/home",
              "https://hiqsense.com/index"
            ],
            "about": [
              "https://hiqsense.com/about-us"
            ],
            "contact": [
              "https://hiqsense.com/contact"
            ],
            "services": [
              "https://hiqsense.com/terms-of-service"
            ],
            "products": [],
            "team": [],
            "blog": [],
            "other": [
              "https://hiqsense.com/sitemap-pages.xml",
              "https://hiqsense.com/sitemap.xml",
              "https://hiqsense.com/faq",
              "https://hiqsense.com/privacy-policy"
            ]
          },
          "prioritizedPages": [
            "https://hiqsense.com/",
            "https://hiqsense.com/home",
            "https://hiqsense.com/index",
            "https://hiqsense.com/about-us",
            "https://hiqsense.com/contact",
            "https://hiqsense.com/terms-of-service",
            "https://hiqsense.com/sitemap-pages.xml",
            "https://hiqsense.com/sitemap.xml",
            "https://hiqsense.com/faq",
            "https://hiqsense.com/privacy-policy"
          ],
          "pageResults": [
            {
              "url": "https://hiqsense.com/",
              "status": "success",
              "duration": 0,
              "title": "HiQSense | AI & Automation for Small Businesses | HiQSense Smart Systems LTD",
              "description": "From web design to AI implementation",
              "content": "Empowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense",
              "contactInfo": {
                "emails": [
                  "hiqsense@hiqsense.ca"
                ],
                "phones": [],
                "addresses": [],
                "phoneDetails": []
              },
              "technologies": [
                "React"
              ],
              "socialLinks": {},
              "keywords": [
                "Empowering Small Businesses with AI and Smart Automation",
                "About HiQSense",
                "Introducing Saski AI — Our Flagship Platform",
                "Frequently Asked Questions",
                "Schedule a Call with HiQSense"
              ]
            },
            {
              "url": "https://hiqsense.com/home",
              "status": "success",
              "duration": 0,
              "title": "HiQSense | AI & Automation for Small Businesses | HiQSense Smart Systems LTD",
              "description": "From web design to AI implementation",
              "content": "Empowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense",
              "contactInfo": {
                "emails": [
                  "hiqsense@hiqsense.ca"
                ],
                "phones": [],
                "addresses": [],
                "phoneDetails": []
              },
              "technologies": [
                "React"
              ],
              "socialLinks": {},
              "keywords": [
                "Empowering Small Businesses with AI and Smart Automation",
                "About HiQSense",
                "Introducing Saski AI — Our Flagship Platform",
                "Frequently Asked Questions",
                "Schedule a Call with HiQSense"
              ]
            },
            {
              "url": "https://hiqsense.com/index",
              "status": "success",
              "duration": 0,
              "title": "HiQSense | AI & Automation for Small Businesses | HiQSense Smart Systems LTD",
              "description": "From web design to AI implementation",
              "content": "Empowering Small Businesses with AI and Smart AutomationFrom web design to AI implementation Book free consultationContact UsWeb DesignWeb DevelopmentMVP DevelopmentMobile AppsAI AssistantsProcess AutomationLoading animated content...Empowering Small Businesses About HiQSenseAt HiQSense, we empower small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. Our mission is to transform how businesses operate by eliminating technical barriers and providing seamless access to intelligent systems that handle everyday tasks. The name HiQSense reflects our vision and values: “Hi” stands for high standards; “Q” represents both IQ (intelligence) and Quality; and “Sense” highlights our belief in AI systems that continue to evolve—developing perceptive, context-aware capabilities that emulate human senses. As technology advances, so will our systems—growing smarter, more intuitive, and more valuable to the businesses we serve. Proudly based in Saskatchewan, Canada, we are committed to supporting local entrepreneurs and contributing to the province’s growing innovation economy. As a Canadian company, we aim to lead in responsible AI adoption—creating tools that are not only effective and scalable but also built with integrity, inclusivity, and a deep understanding of the challenges faced by businesses across the country.Book free consultationIntroducing Saski AI — Our Flagship PlatformSaski AI is a no-code platform that empowers small and medium-sized businesses to automate customer support across SMS, WhatsApp, voice, social media, and websites. By enabling users to build AI assistants in under 10 minutes—without any technical skills—Saski AI helps businesses reduce operational costs, respond instantly to inquiries, and deliver consistent, multilingual service.Visit Saski AIFrequently Asked Questions Schedule a Call with HiQSense",
              "contactInfo": {
                "emails": [
                  "hiqsense@hiqsense.ca"
                ],
                "phones": [],
                "addresses": [],
                "phoneDetails": []
              },
              "technologies": [
                "React"
              ],
              "socialLinks": {},
              "keywords": [
                "Empowering Small Businesses with AI and Smart Automation",
                "About HiQSense",
                "Introducing Saski AI — Our Flagship Platform",
                "Frequently Asked Questions",
                "Schedule a Call with HiQSense"
              ]
            },
            {
              "url": "https://hiqsense.com/about-us",
              "status": "success",
              "duration": 0,
              "title": "About HiQSense | AI-Driven Digital Solutions | HiQSense Smart Systems LTD",
              "description": "HiQSense is a Canadian technology company based in Saskatchewan.\nOur mission is to empower small businesses by making AI accessible, useful, and easy to implement.​",
              "content": "About UsHiQSense is a Canadian technology company based in Saskatchewan. Our mission is to empower small businesses by making AI accessible, useful, and easy to implement.​About HiQSense Our Vision We envision a future where small businesses can harness the power of AI to operate efficiently, reduce costs, and grow sustainably—without needing technical expertise. At HiQSense, we’re committed to building smart, accessible tools that simplify complex tasks. Through innovations like Saski AI, we empower business owners to automate customer support, streamline operations, and focus on what truly matters—their customers and their growth. Our Values Accessibility – We make advanced AI simple and usable for everyone. Empowerment – We enable businesses to automate and grow on their own terms. Innovation – We continuously explore new ways to solve real-world problems. Simplicity – We design intuitive tools that work without complexity. Customer-Centricity – We listen closely and build solutions around real needs. Reliability – We deliver stable, dependable technology you can trust. Book free consultationOur TeamAt the heart of HiQSense is a multidisciplinary team of passionate innovators and builders.Azar ObeidatCo-Founder & CEO Drives HiQSense forward with a vision to make advanced AI accessible and impactful for small businesses. Crafts intuitive interfaces with a focus on user experienceMarwan KhanfarCTO & Co-FounderLeads technology innovation at HiQSense Crafts intuitive interfaces with a focus on user experienceMohammad MelhemCo-Founder - Business Development & StrategiesDrives strategic growth with deep market insight and relentless focus on impact. Schedule a Call with HiQSense",
              "contactInfo": {
                "emails": [
                  "hiqsense@hiqsense.ca"
                ],
                "phones": [],
                "addresses": [],
                "phoneDetails": []
              },
              "technologies": [],
              "socialLinks": {
                "linkedin": "https://linkedin.com/in/azarobeidat"
              },
              "keywords": [
                "About Us",
                "About HiQSense",
                "Our Vision",
                "Our Values",
                "Our Team",
                "Azar Obeidat",
                "Marwan Khanfar",
                "Mohammad Melhem",
                "Schedule a Call with HiQSense"
              ]
            },
            {
              "url": "https://hiqsense.com/contact",
              "status": "success",
              "duration": 0,
              "title": "Contact HiQSense | Web & AI Solutions in Saskatoon | HiQSense Smart Systems LTD",
              "description": "We’d love to learn more about your business. Reach out to explore how we can help.",
              "content": "HomeAbout UsFAQContactBook free consultationGet in TouchWe’d love to learn more about your business. Reach out to explore how we can help. Send Us a MessageConnect With UsHave a question or ready to get started? You can reach us by phone, email, or by visiting our Saskatoon office.Phone+1 306 261 8582Emailinfo@hiqsense.caAddress400-111 2nd Ave S , Saskatoon, SK, CA S7K 1K6Follow UsFirst Name *Last Name Email Address *Phone Number Company Message *I agree to the terms and conditions * Solve the math problemVerify you're human8 - 3 = ? Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
              "contactInfo": {
                "emails": [
                  "info@hiqsense.ca",
                  "hiqsense@hiqsense.ca"
                ],
                "phones": [
                  "+13062618582"
                ],
                "addresses": [],
                "phoneDetails": [
                  {
                    "number": "+13062618582",
                    "source": "tel",
                    "snippet": "+1 306 261 8582"
                  }
                ]
              },
              "technologies": [],
              "socialLinks": {
                "facebook": "https://www.facebook.com/hiqsense/",
                "linkedin": "https://www.linkedin.com/company/hiqsense"
              },
              "keywords": [
                "Get in Touch",
                "Send Us a Message",
                "Connect With Us",
                "Solve the math problem",
                "Schedule a Call with HiQSense"
              ]
            },
            {
              "url": "https://hiqsense.com/terms-of-service",
              "status": "success",
              "duration": 0,
              "title": "Terms of Service | HiQSense in Saskatoon | HiQSense Smart Systems LTD",
              "description": "Effective Date: March 28, 2025",
              "content": "HomeAbout UsFAQContactBook free consultation Terms of Service Effective Date: March 28, 2025 This Terms of Service agreement (\"Agreement\") is entered into by and between HiQSense Smart Systems LTD (\"HiQSense\", \"we\", \"us\", or \"our\"), a Canadian-registered corporation, and any person or entity (\"you\" or \"your\") accessing or using our website, digital products, or custom software and automation services. By accessing our website or engaging our services, you acknowledge that you have read, understood, and agree to be bound by these terms. If you do not agree, please discontinue use of our website and services. 1. Use of Services Our services are intended for lawful business use. You agree not to use our website, platforms, or delivered systems for any unlawful activity or to violate any local, provincial, national, or international regulations. 2. Project Engagement and Scope All services begin with a discovery or consultation phase. Based on your business needs, we prepare a custom scope of work and formal quote. No project will commence until both parties agree in writing to the proposal, deliverables, and payment structure. 3. Pricing and Payment Terms HiQSense does not offer flat-rate pricing. All costs are project-specific and depend on the scope, complexity, and duration of the engagement. Payment terms, including deposits, installment schedules, and final payments, will be detailed in the proposal or service agreement. Late payments may delay delivery or incur additional charges. 4. Ownership and Licensing Unless otherwise agreed in writing, all custom-built code, workflows, or software solutions developed under a paid contract become the property of the client upon final payment. HiQSense retains the right to reuse general frameworks or non-client-specific utilities developed independently. 5. Confidentiality We maintain strict confidentiality over all materials, communications, and proprietary business or technical information shared with us. We will not disclose your data, ideas, designs, or internal systems to any third party without prior consent. 6. Hosting and Maintenance Hosting, updates, and technical support are not included by default. These services may be added under an Annual Maintenance Contract (AMC), which covers hosting management, software updates, minor modifications, and troubleshooting. 7. Limitations of Liability HiQSense makes every effort to build secure, reliable systems. However, we do not guarantee uninterrupted or error-free operation and are not liable for losses resulting from downtime, third-party service interruptions, or client-side misuse. Our liability is limited to the total fees paid under the specific service agreement. 8. Termination Either party may terminate an agreement with written notice. In the event of early termination by the client, any work completed to date will be invoiced and due. HiQSense reserves the right to suspend service or access in case of non-payment or violation of these terms. 9. Governing Law This Agreement is governed by the laws of the Province of Saskatchewan and applicable federal laws of Canada. Any disputes arising out of this Agreement shall be resolved through mediation or the courts of Saskatchewan. 10. Contact If you have questions about these terms, please contact us:HiQSense Smart Systems LTD400 – 111 2nd Ave S, Saskatoon, SK, S7K 1K6Email: info@hiqsense.caPhone: +1 306 261 8582 Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
              "contactInfo": {
                "emails": [
                  "info@hiqsense.ca",
                  "hiqsense@hiqsense.ca"
                ],
                "phones": [
                  "+13062618582"
                ],
                "addresses": [],
                "phoneDetails": [
                  {
                    "number": "+13062618582",
                    "source": "tel",
                    "snippet": "+1 306 261 8582"
                  }
                ]
              },
              "technologies": [],
              "socialLinks": {
                "facebook": "https://www.facebook.com/hiqsense/",
                "linkedin": "https://www.linkedin.com/company/hiqsense"
              },
              "keywords": [
                "Terms of Service",
                "1. Use of Services",
                "2. Project Engagement and Scope",
                "3. Pricing and Payment Terms",
                "4. Ownership and Licensing",
                "5. Confidentiality",
                "6. Hosting and Maintenance",
                "7. Limitations of Liability",
                "8. Termination",
                "9. Governing Law",
                "10. Contact",
                "Schedule a Call with HiQSense"
              ]
            },
            {
              "url": "https://hiqsense.com/sitemap-pages.xml",
              "status": "success",
              "duration": 0,
              "title": "XML Sitemap - Pages",
              "description": "This sitemap contains all the main pages of our website.",
              "content": "XML Sitemap - Pages This sitemap contains all the main pages of our website. You can find more information about XML sitemaps on sitemaps.org. ← Back to Sitemap Index Pages Overview: This sitemap contains 6 pages, last updated on 2025-08-13 02:44:36 +00:00. Page URL Priority Change Frequency Last Modified https://hiqsense.com/about-us 0.7 monthly 2025-07-30 01:13:23 +00:00 https://hiqsense.com/contact 0.7 monthly 2025-07-30 01:14:13 +00:00 https://hiqsense.com/faq 0.8 weekly 2025-07-30 01:13:46 +00:00 https://hiqsense.com/home 1.0 weekly 2025-07-30 01:12:18 +00:00 https://hiqsense.com/privacy-policy 0.7 monthly 2025-07-30 01:15:11 +00:00 https://hiqsense.com/terms-of-service 0.7 monthly 2025-07-30 01:14:51 +00:00",
              "contactInfo": {
                "emails": [],
                "phones": [
                  "2025081302",
                  "2025073001"
                ],
                "addresses": [],
                "phoneDetails": [
                  {
                    "number": "2025081302",
                    "source": "text",
                    "snippet": "x Pages Overview: This sitemap contains 6 pages, last updated on 2025-08-13 02:44:36 +00:00. Page URL Priority Ch"
                  },
                  {
                    "number": "2025073001",
                    "source": "text",
                    "snippet": "ps://hiqsense.com/about-us 0.7 monthly 2025-07-30 01:13:23 +00:00 https://hiqsense.com/cont"
                  }
                ]
              },
              "technologies": [],
              "socialLinks": {},
              "keywords": [
                "XML Sitemap - Pages",
                "Pages Overview:"
              ]
            },
            {
              "url": "https://hiqsense.com/sitemap.xml",
              "status": "success",
              "duration": 0,
              "title": "",
              "description": "",
              "content": "https://hiqsense.com/sitemap-pages.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-faq-categories.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-faq-questions.xml 2025-08-13T02:35:56.429Z https://hiqsense.com/sitemap-images.xml 2025-08-13T02:35:56.429Z This XML file does not appear to have any style information associated with it. The document tree is shown below.<sitemapindex xmlns=\"http://www.sitemaps.org/schemas/sitemap/0.9\"> <sitemap> <loc>https://hiqsense.com/sitemap-pages.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-faq-categories.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-faq-questions.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> <sitemap> <loc>https://hiqsense.com/sitemap-images.xml</loc> <lastmod>2025-08-13T02:35:56.429Z</lastmod> ...</sitemap> ...</sitemapindex>",
              "contactInfo": {
                "emails": [],
                "phones": [],
                "addresses": [],
                "phoneDetails": []
              },
              "technologies": [],
              "socialLinks": {},
              "keywords": []
            },
            {
              "url": "https://hiqsense.com/faq",
              "status": "success",
              "duration": 0,
              "title": "FAQs | HiQSense Services & AI Development in Saskatoon | HiQSense Smart Systems LTD",
              "description": "",
              "content": "HomeAbout UsFAQContactBook free consultationFrequently Asked QuestionsQuick NavigationGot Questions ? Let's Find an Answer Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
              "contactInfo": {
                "emails": [
                  "info@hiqsense.ca",
                  "hiqsense@hiqsense.ca"
                ],
                "phones": [
                  "+13062618582"
                ],
                "addresses": [],
                "phoneDetails": [
                  {
                    "number": "+13062618582",
                    "source": "tel",
                    "snippet": "+1 306 261 8582"
                  }
                ]
              },
              "technologies": [
                "Shopify",
                "WooCommerce",
                "React",
                "Tailwind",
                "AWS",
                "Google Cloud",
                "Stripe",
                "HubSpot"
              ],
              "socialLinks": {
                "facebook": "https://www.facebook.com/hiqsense/",
                "linkedin": "https://www.linkedin.com/company/hiqsense"
              },
              "keywords": [
                "Frequently Asked Questions",
                "Quick Navigation",
                "Got Questions ? Let's Find an Answer",
                "Schedule a Call with HiQSense"
              ]
            },
            {
              "url": "https://hiqsense.com/privacy-policy",
              "status": "success",
              "duration": 0,
              "title": "Privacy Policy | HiQSense Smart Systems LTD | HiQSense Smart Systems LTD",
              "description": "Effective Date: March 28, 2025",
              "content": "HomeAbout UsFAQContactBook free consultation Privacy Policy Effective Date: March 28, 2025 HiQSense Smart Systems LTD (\"HiQSense\", \"we\", \"our\", or \"us\") is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you interact with our website or services. 1. Information We Collect Personal Information: When you fill out forms, book consultations, or work with us, we may collect your name, email, phone number, and relevant business information. Technical Information: We may collect anonymized data such as IP address, browser type, device type, and browsing behavior using analytics tools like Google Analytics or Hotjar to improve user experience. Project Files & Data: If you provide documents, designs, APIs, databases, or content to complete your project, this information is treated as strictly confidential and is used only for the purpose of delivering the contracted services. 2. How We Use Your Information To communicate with you regarding your inquiry, consultation, or project To assess and deliver the services you request To improve our website and service offerings To manage billing and client accounts To comply with legal and regulatory obligations 3. Sharing of Information We do not sell, trade, or rent your personal information to third parties. We may share information with trusted partners only when necessary to operate our business—such as hosting providers (AWS, GCP, Heroku), payment processors (Stripe), or communication tools (Twilio, Calendly). These partners are required to protect your data in accordance with their own privacy policies and data protection laws. 4. Data Security We implement reasonable administrative, technical, and physical safeguards to protect your information from unauthorized access, use, or disclosure. This includes secure storage, access control, encryption, and regular security audits. 5. Data Retention We retain your information for as long as necessary to provide services and as required by law. You may request deletion of your personal data or project files at any time, unless retention is required for legal or operational reasons. 6. Your Rights You have the right to request access to your personal data, correct inaccuracies, or ask us to delete your information. To make such a request, please contact us using the details below. 7. Changes to This Policy We may update this Privacy Policy to reflect changes to our practices or legal obligations. Updates will be posted on this page with the revised effective date. 8. Contact If you have any questions or concerns about this policy, please contact us: HiQSense Smart Systems LTD 400 – 111 2nd Ave S, Saskatoon, SK, S7K 1K6 Email: info@hiqsense.ca Phone: +1 306 261 8582 Schedule a Call with HiQSense info@hiqsense.ca+1 306 261 8582400-111 2nd Ave S, Saskatoon , SK CA, S7K 1K6Legal PagesPrivacy PolicyTerms of ServiceMain PagesHomeAbout UsFAQContact©2025 All rights reserved for HiQSense Smart Systems LTD",
              "contactInfo": {
                "emails": [
                  "info@hiqsense.ca",
                  "hiqsense@hiqsense.ca"
                ],
                "phones": [
                  "+13062618582"
                ],
                "addresses": [],
                "phoneDetails": [
                  {
                    "number": "+13062618582",
                    "source": "tel",
                    "snippet": "+1 306 261 8582"
                  }
                ]
              },
              "technologies": [
                "AWS",
                "Stripe"
              ],
              "socialLinks": {
                "facebook": "https://www.facebook.com/hiqsense/",
                "linkedin": "https://www.linkedin.com/company/hiqsense"
              },
              "keywords": [
                "Privacy Policy",
                "1. Information We Collect",
                "2. How We Use Your Information",
                "3. Sharing of Information",
                "4. Data Security",
                "5. Data Retention",
                "6. Your Rights",
                "7. Changes to This Policy",
                "8. Contact",
                "Schedule a Call with HiQSense"
              ]
            }
          ]
        },
        "googleSearch": {
          "searchResults": [
            {
              "title": "Smart Track for Telecom and Electronics Services | LinkedIn",
              "link": "https://www.linkedin.com/company/smarttrackjor",
              "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan · GPS.AZ. IT Services and IT Consulting · The Ritz-Carlton, Amman. Hospitality ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "LightLeaf Solar | LinkedIn",
              "link": "https://ca.linkedin.com/company/lightleafsolar",
              "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan · AgriReach. Software Development · Bright Autonomy. Automation Machinery ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "ABAzyne Bioscience Inc. | LinkedIn",
              "link": "https://www.linkedin.com/company/abazyne-bioscience-inc",
              "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan. Show more similar pages. Show fewer similar pages. Browse jobs. User Experience ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "VistaPM by Vistaraa IT | LinkedIn",
              "link": "https://ca.linkedin.com/company/vistaraait",
              "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan · AgriReach. Software Development · Laroye AI. Software Development. Regina, ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Mieyar | LinkedIn",
              "link": "https://www.linkedin.com/company/mieyarae",
              "snippet": "Hiqsense Smart Systems LTD. Software Development. Saskatoon, Saskatchewan. Originova. IT Services and IT Consulting. FreshNow.ae. Food and Beverage Services.",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Azar Obeidat - Founder at HiQSense | LinkedIn",
              "link": "https://ca.linkedin.com/in/azarobeidat",
              "snippet": "Founder at HiQSense. Hiqsense Smart Systems LTD Jordan University of Science & Technolgy. Saskatoon, Saskatchewan, Canada. 2K followers 500+ connections. See ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "تقوم شركة Hiqsense Smart Systems LTD بالتوظيف لوظيفة Digital ...",
              "link": "https://jo.linkedin.com/jobs/view/digital-marketing-specialist-at-hiqsense-smart-systems-ltd-4215283723",
              "snippet": "HiQSense Smart Systems LTD empowers small businesses with advanced AI solutions to automate tasks and reduce operational costs. Our flagship platform, Saski AI, ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Mohammad Melhem‏ - ‏Executive Director at Kabri International Co ...",
              "link": "https://ae.linkedin.com/in/mohammad-melhem",
              "snippet": "رسم بياني Hiqsense Smart Systems LTD. Co-Founder. Hiqsense Smart Systems LTD. سبتمبر ٢٠٢٤⁦ ⁩ - الحالي 1 عام واحد. Business Development Manager. Kabri ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Suresh Soundararajan - Project Manager at ABU HATIM CO LLC ...",
              "link": "https://www.linkedin.com/in/suresh-soundararajan-2b866752",
              "snippet": "Construction of Pre Engineered Building of Area 28000 Sqm for a Warehouse in a Land Extent of 44000 Sqm. The Steel Structure was supplied by M/s Zamil Steel ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Jamal AL-Zain - PROJECT MANAGER | LinkedIn",
              "link": "https://www.linkedin.com/in/engineerjamalalzain",
              "snippet": "PROJECT MANAGER · PROJECT MANAGER · Experience: Beit Hanina for contracting · Education: Kiev-National-University-of-Construction-and-Architecture ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏mahmoud awad‏ - ‏Project Manager PMP®‏ | LinkedIn",
              "link": "https://ae.linkedin.com/in/mahmoud-awad-45b13843",
              "snippet": "الخبرة · Project Manager. Lazourdy Contracting and General Maintenance. يونيو ٢٠١٩⁦ ⁩ - الحالي 6 عام 3 شهر. Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Aidan Suckling - Project Manager at Naylor Love | LinkedIn",
              "link": "https://nz.linkedin.com/in/aidan-suckling-8b082a20",
              "snippet": "Education · Canterbury University. BE (hons) Engineering. 2000 - 2003 · Otago Polytechnic. NZCE Mechanical Engineering. 1997 - 1999 ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Suzanne Hussey - Ballymore | LinkedIn",
              "link": "https://ie.linkedin.com/in/suzanne-hussey-7a1b0217",
              "snippet": "Experienced project manager directing multi-million value residential, commercial and… · Experience: Ballymore · Education: Trinity College, ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Joe Fakhoury - Project Manager | Development Manager ...",
              "link": "https://www.linkedin.com/in/joe-fakhoury-85288050",
              "snippet": "Professional Engineer with over 15 years of experience managing large scale projects ranging from high end residential towers, hotels and mixed use ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "John Deenihan Ph.D, PMP, B.A., B.A.I., CEng MIEI - TOBIN | LinkedIn",
              "link": "https://ie.linkedin.com/in/johndeenihan",
              "snippet": "Inelastic Performance of High Strength Concrete Composite Columns Subject to Earthquake Loading Conditions. 14th European Conference on Earthquake Engineering, ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Pankaj Shringarpure - Project Manager at Bin Ham Electro ...",
              "link": "https://www.linkedin.com/in/pankaj-shringarpure-a3a47823",
              "snippet": "Gained first hand experience in various office administrative functions as logistics, material management, visas, accounting and finance functions and basis IT ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Gert Olivier - Project Manager at McConnell Dowell | LinkedIn",
              "link": "https://au.linkedin.com/in/gert-olivier-a629ab39",
              "snippet": "... Free State · Location: Narangba · 500+ connections on LinkedIn. View Gert ... I also compiled Technical Bids for several Tenders from the regional office in Dubai ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Companies starting with 'H'",
              "link": "https://ca.linkedin.com/directory/companies/h",
              "snippet": "HPDG Associés inc. Holiday Inn Toronto International Airport · HOPE International Development Agency · HydroFLOW® Canada · Hiqsense Smart Systems LTD · Hiregood ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Ivan Kucherenko,MCIOB - Project Manager at PMKConsult | LinkedIn",
              "link": "https://ae.linkedin.com/in/kucherenkoivan/en",
              "snippet": "Develop a financial model in collaboration with Partnerships & Investment and other relevant functions. • Manage developments from inception to completion ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Khaled Farchoukh‏ - ‏PMP, MEM‏ | LinkedIn",
              "link": "https://ae.linkedin.com/in/khaled-farchoukh-217b03185",
              "snippet": "Bonyan International Investment Group (Holding) LLC ... Financial Management and Leading in Contemporary Organizations.",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Hossam Abbas‏ - A Member of National Gulf Investments",
              "link": "https://ae.linkedin.com/in/hossam-abbas-19288259",
              "snippet": "Project Manager at National Gulf Constructions - A Member of National Gulf Investments‏ · ‏Dear Sir/Madam Good Day With this letter and resume, ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Hassan Ali‏ - ‏Project Manager‏ | LinkedIn",
              "link": "https://ae.linkedin.com/in/hassan-ali-4b6460171",
              "snippet": "4 عام 7 شهر. Abu Dhabi, United Arab Emirates. Project: Al Saadiyat Villas Development Client: TDIC (Tourism Development & Investment Company) Project Value ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Pran Bhuiyan‏ - ‏Oracle‏ | LinkedIn",
              "link": "https://ae.linkedin.com/in/pran-bhuiyan-9a49b128",
              "snippet": "A PRINCE2 Project Manager and Civil Engineer with over thirteen years experience in…‏ · الخبرة: ‏Oracle‏ · الموقع: ‏ميلبورن‏ · أكثر من ٥٠٠ زميل على LinkedIn ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Gowsik Roshan Vijayan‏ - ‏Project Manager - PMP® - MBA (FM), CIE ...",
              "link": "https://ae.linkedin.com/in/gowsik-roshan-vijayan-a03544111",
              "snippet": "Master of Business Administration - MBA Finance and Financial Management Services. ٢٠٢٠ - ٢٠٢٢. S.L.B Higher Secondary School. Computer Science. ٢٠٠٤ - ٢٠١٠.",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Thomas Dieball‏ - ‏Manager - Business Development Asia Pacific at ...",
              "link": "https://ae.linkedin.com/in/thomas-dieball-85382518",
              "snippet": "٢٠٠٤ - ٢٠٠٩. التراخيص والشهادات. Diploma of Project Management - Cert. IV. TAFE. Engineer in Training. Illinois Department of Financial & Professional ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Remon Faltas‏ - ‏Technical Manager at East Coast Contracting And ...",
              "link": "https://ae.linkedin.com/in/remon-faltas-498b1365",
              "snippet": "Site Engineer for Inter-Continental Construction and Tourism Investment (S.A.E). التعليم. رسم بياني Alexandria University · Alexandria University. bachelor's ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Abdelhadi Albashtawi - Project Manager | LinkedIn",
              "link": "https://ca.linkedin.com/in/abdelhadi-albashtawi-296459b3",
              "snippet": "Proficient in the management of all types of construction projects with the project cost review, project design review, budgeting, estimating and tendering.",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Mario Manipol - Project Manager at Gunn Lennon Fabrication ...",
              "link": "https://ie.linkedin.com/in/mario-manipol-5385b395",
              "snippet": "Consulting. Engineering) as Senior QA/QC Facade Consultant who do review and research options for the Design Drawings; Prepare detailed Method Statement and ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Muhammad Majid Samin - Technical Advisor @ Roads and ...",
              "link": "https://au.linkedin.com/in/muhammad-majid-samin-26325a20",
              "snippet": "Handing Over, Final and End of Defects Liability Inspections for major and minor road network in Dubai, Preliminary design reviews, of road projects, Issuance ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Christopher Murgia - General Manager (QLD) at West to West Group ...",
              "link": "https://www.linkedin.com/in/christopher-murgia-107ab2b0",
              "snippet": "Subcontract and supplier procurement. Façade works management. Field support to Site Managers. Preparation of Project Safety Plan and ongoing review and ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Matias Borquez - Project Manager, PMP / Civil Engineer | LinkedIn",
              "link": "https://ae.linkedin.com/in/matias-borquez-mb/en",
              "snippet": "Identification of risks. • Procurement. • Communication with stakeholders. • Review of structural and other technical submittals. • Construction management ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Adnan Syed‏ - ‏Regional After Sales Manager at Linx Printing ...",
              "link": "https://ae.linkedin.com/in/adnan-syed-pmp",
              "snippet": "Regional After Sales Manager at Linx Printing Technologies‏ · ‏Ever had a super active classmate who was always organizing events, leading clubs ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Shashank bhardwaj‏ - ‏Project Director - Corporate Principal at ...",
              "link": "https://ae.linkedin.com/in/shashank-bhardwaj-40324925",
              "snippet": "Karnataka State Open University. B-Tech in Civil Engineering. ٢٠١١ - ٢٠١٤. Board of Technical Education New Delhi. Civil Engineering Civil Engineering. ٢٠٠١ - ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Mubashir Uddin‏ - ‏Project Manager at QWAED CONTRACTING L.L.C ...",
              "link": "https://ae.linkedin.com/in/mubashiruddin",
              "snippet": "... Technology‏ · الموقع: ‏الإمارات العربية المتحدة‏ · أكثر من ٥٠٠ زميل على ... Using planning software namely; M.S project to plan the work and cost ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏Abdelazim Sherif‏ - ‏Senior Associate - Head of Structures‏ | LinkedIn",
              "link": "https://ae.linkedin.com/in/abdelazim-sherif-20642414",
              "snippet": "... solutions for their needs. I mentors mid level and junior structural engineers in utilizing advanced computer software such as SAP, ETABS, SAFE, STAAD ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "‏MOINUDDIN ANSARI‏ - ‏PMP | Project & Construction Management ...",
              "link": "https://ae.linkedin.com/in/moinuddin-ansari-b3682258",
              "snippet": "Key highlights of my career include: Spearheading the development and delivery of a $3 billion healthcare facility, setting new benchmarks in project execution ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Majd Abudagga - Account Executive - Autodesk Construction Cloud ...",
              "link": "https://au.linkedin.com/in/majd-abudagga-9331b047",
              "snippet": "Join now Sign in. Majd Abudagga. Expand search. People. This button displays ... Majd's career began in construction engineering, where he contributed to ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Luke Konia - Project Manager and Engineer, Civil Construction ...",
              "link": "https://pg.linkedin.com/in/luke-konia-9aabb651",
              "snippet": "Join now Sign in. Luke Konia. Expand search. People. This button displays the currently selected search type. When expanded it provides a list of search options ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Joseph Gonsalves - Project Manager at Turner Construction ...",
              "link": "https://in.linkedin.com/in/jsg180558",
              "snippet": "Join now Sign in. Joseph Gonsalves. Expand search. People. This button displays the currently selected search type. When expanded it provides a list of search ...",
              "source": "LinkedIn",
              "relevance": 1
            },
            {
              "title": "Saski AI Integration – WordPress plugin | WordPress.org Slovensko",
              "link": "https://sk.wordpress.org/plugins/saski-ai-integration/",
              "snippet": "... on your website. Service Used: Saski AI Widget and API, provided by HiQSense Smart Systems LTD; Purpose: To render an AI-powered assistant that interacts ...",
              "source": "News",
              "relevance": 0.7
            },
            {
              "title": "HiQSense Smart Systems LTD: HiQSense | AI & Automation for ...",
              "link": "https://hiqsense.com/",
              "snippet": "HiQSense is a Canadian company specializing in web design, web development, AI-powered applications, and mobile app solutions. We help small businesses ...",
              "source": "Other",
              "relevance": 0.2
            },
            {
              "title": "Hiqsense Smart Systems | Saskatoon SK",
              "link": "https://www.facebook.com/hiqsense/",
              "snippet": "Hiqsense Smart Systems, Saskatoon. 1203 likes. Empowering businesses with top-tier web and graphic design, SEO, and email at affordable prices.",
              "source": "Other",
              "relevance": 0.2
            },
            {
              "title": "Has anyone found any good AI chatbots that can access user ...",
              "link": "https://www.reddit.com/r/woocommerce/comments/1kzing7/has_anyone_found_any_good_ai_chatbots_that_can/",
              "snippet": "May 30, 2025 ... WP Bot - lots of good reviews. Build your own - looks cool. Here's ... HiQSense. • 4d ago. Yes , Saski AI https://youtu.be/1yr9Mc5y-Ds?si ...",
              "source": "Other",
              "relevance": 0.2
            },
            {
              "title": "Which are the top three AI supported chatbots for Woocomerce : r ...",
              "link": "https://www.reddit.com/r/woocommerce/comments/1kf4rrp/which_are_the_top_three_ai_supported_chatbots_for/",
              "snippet": "May 5, 2025 ... Comments Section. AuGKlasD. • 3mo ago ... HiQSense. • 4d ago. Have you checked this ? https://youtu.be/1yr9Mc5y ...",
              "source": "Other",
              "relevance": 0.2
            },
            {
              "title": "Web Development Services | Harshil Khimasia - Freelance Web ...",
              "link": "https://harshilkhimasia.com/",
              "snippet": "Tech Stack. Tools & Technologies. Here are the tools and technologies I use ... Hiqsense Solutions. \"He is one of the best freelancers I have every worked ...",
              "source": "Other",
              "relevance": 0.2
            },
            {
              "title": "Hiqsense Smart Systems LTD - - Remote Job -",
              "link": "https://www.facebook.com/hiqsense/posts/hiqsense-smart-systems-ltd-remote-job-/122121307568231512/",
              "snippet": "Mar 25, 2024 ... Hiqsense Smart Systems LTD - - Remote Job - ... Just shared a quick whiteboard explainer of Saski AI — our no-code platform built to help small ...",
              "source": "Other",
              "relevance": 0.2
            }
          ],
          "extractedInfo": {
            "news": [
              "Saski AI Integration – WordPress plugin | WordPress.org Slovensko"
            ],
            "reviews": []
          },
          "lastSearched": "2025-08-13T03:14:05.680Z"
        },
        "llm": {
          "company": {
            "legalName": "HiQSense Smart Systems LTD",
            "dba": "HiQSense",
            "industry": "Software Development",
            "description": "HiQSense empowers small and medium-sized businesses with advanced, AI-driven automation designed to simplify operations, reduce costs, and accelerate growth. The company specializes in web design, web development, AI-powered applications, and mobile app solutions."
          },
          "business": {
            "targetCustomers": [
              "Small and medium-sized businesses"
            ],
            "funding": [],
            "revenue": "Unknown",
            "founded": "Unknown",
            "categories": [
              "AI & Automation",
              "Web Design",
              "Web Development",
              "Mobile Apps",
              "Process Automation"
            ]
          },
          "people": {
            "executives": [
              {
                "name": "Azar Obeidat",
                "title": "Founder",
                "linkedin": "https://linkedin.com/in/azarobeidat"
              }
            ],
            "employeeCount": "Unknown"
          },
          "technology": {
            "platforms": [
              "React",
              "Shopify",
              "WooCommerce"
            ],
            "tools": [
              "Stripe",
              "HubSpot"
            ],
            "infrastructure": [
              "AWS",
              "Google Cloud"
            ]
          },
          "market": {
            "targetCustomers": [
              "Small and medium-sized businesses"
            ],
            "competitors": [],
            "geographic": [
              "Saskatchewan, Canada"
            ]
          },
          "processedAt": "2025-08-13T03:14:44.770Z",
          "confidence": 0.8
        }
      }
    },
    "conflicts": [],
    "mergeStrategy": "priority-based with conflict resolution"
  },
  "metadata": {
    "stepType": "consolidation",
    "dataSources": [],
    "conflictsCount": 0,
    "mergeStrategy": "priority-based with conflict resolution"
  }
}